Обработки/Reports/_РасшифровкаАнализСправедливойСтоимостиАктивовНеОцениваемыхПоСC.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасшифровкаАнализСправедливойСтоимостиАктивовНеОцениваемыхПоСC</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасшифровкаАнализСправедливойСтоимостиАктивовНеОцениваемыхПоСC/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура КомандаСформироватьНаСервере()
	
	СписокСчетовДУ = РеквизитФормыВЗначение("Отчет").ПолучитьСписокСчетовДУ(ЭтотОбъект.ОтчетПоКлиенту);

	Если СписокСчетовДУ.Количество() > 0 Тогда
		//возьмем настройки из Баланса, чтобы распределять результат по строкам:    
		НастройкиОтчетаБаланс = РегистрыСведений.СоставИНастройкиОтчетов.ПолучитьНастройкиОтчета(Отчет.Период, СписокСчетовДУ[0], "РегламентированныйОтчетБаланс");
		РеквизитФормыВЗначение("Отчет").СформироватьОтчет(ЭтотОбъект.Результат, НастройкиОтчетаБаланс, СписокСчетовДУ);  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать(Команда) 
	
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	КомандаСформироватьНаСервере(); 
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат); 

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	Если Параметры.Свойство("СчетДоверительногоУправления") Тогда
		Отчет.СчетДоверительногоУправления = Параметры.СчетДоверительногоУправления;
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		Отчет.Период = Параметры.Период;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	ОтчетПоКлиенту = Ложь;
	НастроитьВидимостьДоступность();
	
	Если ЗначениеЗаполнено(Отчет.СчетДоверительногоУправления) 
		И ЗначениеЗаполнено(Отчет.Период) Тогда
		КомандаСформироватьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоКлиентуПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры


&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	Элементы.Клиент.Видимость = ОтчетПоКлиенту;
	Элементы.СчетДоверительногоУправления.Видимость = Не ОтчетПоКлиенту;
	
	Если ОтчетПоКлиенту Тогда 
		Отчет.СчетДоверительногоУправления = "";
	Иначе
		Отчет.Клиент = "";
	КонецЕсли; 
	
КонецПроцедуры
